
Функция ПолучитьСписокКарт(ИсточникДанных) Экспорт
	Источник = ИсточникДанных;
	Попытка
		Результат = новый Массив;
		Выполнить(ТекстПрограммы);
		Возврат(Результат);
	Исключение
		ЗаписьЖурналаРегистрации("ОСМИ.Ошибка",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Возврат Новый Массив;
	КонецПопытки;
КонецФункции

Функция ОтработатьСобытие(ИсточникСобытия) Экспорт
	
	Попытка
		
		СписокКарт = ПолучитьСписокКарт(ИсточникСобытия);
		
		Если Действие = Перечисления.ОСМИ_Действие.ОтправитьДанныеКартыНаСервер Тогда
			Для Каждого Карта из СписокКарт Цикл
				Карта = ОСМИ_ОбщиеСервер.ПолучитьЭлектроннуюКарту(Карта);
				Если не Карта = Неопределено Тогда
					КартаОбъект = Карта.ПолучитьОбъект();
					КартаОбъект.УстановитьЗначенияПолей();
					КартаОбъект.ОбновитьЗначенияССервера();
					КартаОбъект.ОбменДанными.Загрузка = Истина;
					КартаОбъект.Записать();
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли Действие = Перечисления.ОСМИ_Действие.ПушРассылка Тогда
			ПушРассылка = Документы.ОСМИ_ПушРассылка.СоздатьДокумент();
			Для Каждого Карта из СписокКарт Цикл
				Стр = ПушРассылка.Адресаты.Добавить();
				Стр.Карта = Карта;
			КонецЦикла;
			Если ПушРассылка.Адресаты.Количество() > 0 Тогда 
				ПушРассылка.Дата = ТекущаяДата();
				ПушРассылка.ТекстСообщения = ТекстРассылки;
				ПушРассылка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		ИначеЕсли Действие = Перечисления.ОСМИ_Действие.МаркетинговаяАкция Тогда
			МаркетинговаяАкция =  Документы.ОСМИ_ДинамическаяАкция.СоздатьДокумент();
			Для Каждого Карта из СписокКарт Цикл
				Стр = МаркетинговаяАкция.Адресаты.Добавить();
				Стр.Карта = Карта;
			КонецЦикла;
			Если ПушРассылка.Адресаты.Количество() > 0 Тогда 
				МаркетинговаяАкция.Дата = ТекущаяДата();
				МаркетинговаяАкция.ТекстСообщения = ТекстРассылки;
				МаркетинговаяАкция.ТекстАкции = ТекстПоля;
				МаркетинговаяАкция.ТекстЗаголовка = ТекстЗаголовка;
				МаркетинговаяАкция.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		ЗаписьЖурналаРегистрации("ОСМИ.Ошибка",УровеньЖурналаРегистрации.Ошибка,,ссылка,
		ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции