
&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	Записать();
	Пинг = ОСМИ_РаботаСAPI.ПроверитьПодключениеКСервису();
	Сообщение = Новый СообщениеПользователю;
	Если Пинг.Успех Тогда 
		Сообщение.Текст = "Соединение установлено";
	Иначе
		Сообщение.Текст = "Соединение не установлено";
	КонецЕсли;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	ПроверитьСоединениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ОСМИ_ИспользоватьСертификатПриИзменении(Элемент)
	ОбновитьОтображение()
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	Серт = КонстантыФорма.ОСМИ_ИспользоватьСертификат;
	ЭтаФорма.Элементы.ОСМИ_APIID.Видимость = не Серт;
	ЭтаФорма.Элементы.ОСМИ_APIKEY.Видимость = не Серт;
	ЭтаФорма.Элементы.ОСМИ_ПарольОтСертификата.Видимость = Серт;
	ЭтаФорма.Элементы.ОСМИ_РасполажениеСертификата.Видимость = Серт;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображение()
КонецПроцедуры


&НаКлиенте
Процедура ОСМИ_РасполажениеСертификатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр = "Сертификат (*.pfx)|*.pfx";
	ДиалогФыбораФайла.Заголовок = "Укажите файл сертификата";                                         
	ДиалогФыбораФайла.ПредварительныйПросмотр = Истина;
	ДиалогФыбораФайла.ИндексФильтра = 0;
	ДиалогФыбораФайла.МножественныйВыбор = Ложь;
	ДиалогФыбораФайла.Показать(Новый ОписаниеОповещения("ОСМИ_РасполажениеСертификатаНачалоВыбораЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ОСМИ_РасполажениеСертификатаНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		КонстантыФорма.ОСМИ_РасполажениеСертификата = ВыбранныеФайлы[0];	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросНаСертификатНажатие(Элемент)
	НачатьЗапускПриложения(Новый ОписаниеОповещения("ОтправитьЗапросНаСертификатНажатиеЗавершение", ЭтотОбъект), "mailto:support@osmicards.com?Subject=SSL%20Request&Body=Прошу предоставить клиентский сертификат для работы с сервисом ОСМИ.");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросНаСертификатНажатиеЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт	
КонецПроцедуры



