
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекНомер = 0;
КонецПроцедуры

&НаСервере
Функция ДалееНаСервере(ТекИнструкция,ТекстИнструкции)
	Об = РеквизитФормыВЗначение("Объект");
	
	Макет = Об.ПолучитьМакет("Инструкция"+ТекНомер);
	Макет2 = Об.ПолучитьМакет("ИнструкцияТекст"+ТекНомер);
	
	ТекстИнструкции.Очистить();
	ТекстИнструкции.УстановитьТекст(Макет2.ПолучитьТекст());
	
	ТекИнструкция.Очистить();
	ТекИнструкция.Вывести(Макет);
КонецФункции


&НаКлиенте
Процедура Далее(Команда)
	ТекНомер = ТекНомер +1;
	Если ТекНомер < 0 Тогда 
		ТекНомер = 0;
	КонецЕсли;
	Если ТекНомер > 7 Тогда 
		ТекНомер = 7;
	КонецЕсли;
	
	ДалееНаСервере(ТекИнструкция,ТекстИнструкции);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ТекНомер = ТекНомер -1;
	Если ТекНомер < 0 Тогда 
		ТекНомер = 0;
	КонецЕсли;
	Если ТекНомер > 7 Тогда 
		ТекНомер = 7;
	КонецЕсли;
	
	ДалееНаСервере(ТекИнструкция,ТекстИнструкции);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекНомер = 0;
	
	ДалееНаСервере(ТекИнструкция,ТекстИнструкции);
КонецПроцедуры
