
&НаКлиенте
Процедура СистемаВключенаПриИзменении(Элемент)
	ИзменитьНастройку();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
КонецПроцедуры

&НаСервере
Процедура ИзменитьНастройку()
	
	Константы.ОСМИ_ПодсистемаВключена.Установить(СистемаВключена);
	
	Если СистемаВключена Тогда
		ЗаписьЖурналаРегистрации("ОСМИ.Настройка", УровеньЖурналаРегистрации.Предупреждение,,, "Подсистема ОСМИ включена");
	Иначе
		ЗаписьЖурналаРегистрации("ОСМИ.Настройка", УровеньЖурналаРегистрации.Предупреждение,,, "Подсистема ОСМИ отключена");
	КонецЕсли;
	
КонецПроцедуры
