
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьОтображение();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображение()
		
КонецПроцедуры


&НаКлиенте
Процедура РегГруппаПриИзменении(Элемент)
	РегГруппаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура РегГруппаПриИзмененииНаСервере()
	
	Об = РегГруппа.ПолучитьОбъект();
	
	ЗначениеВРеквизитФормы(Об,"Объект");
	
КонецПроцедуры


&НаКлиенте
Процедура ВходныеПараметрыПриИзменении(Элемент)
	ВходныеПараметрыПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ВходныеПараметрыПриИзмененииНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	
	Об.Записать();
	
	ЗначениеВРеквизитФормы(Об,"Объект");
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ВходныеПараметрыПриИзмененииНаСервере()
КонецПроцедуры

