
Процедура ПроведениеДокументовОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОСМИ_НастройкаСобытий.Ссылка
	|ИЗ
	|	Справочник.ОСМИ_НастройкаСобытий КАК ОСМИ_НастройкаСобытий
	|ГДЕ
	|	ОСМИ_НастройкаСобытий.ОбъектКонфигурации = &ОбъектКонфигурации
	|	И ОСМИ_НастройкаСобытий.Использование";
	Запрос.УстановитьПараметр("ОбъектКонфигурации", Метаданные.НайтиПоТипу(ТипЗнч(Источник.Ссылка)).ПолноеИмя());
	
	Выб = ЗАпрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Выб.Ссылка.ПолучитьОбъект().ОтработатьСобытие(Источник.Ссылка);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписьСправочникаПриЗаписи(Источник, Отказ) Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОСМИ_НастройкаСобытий.Ссылка
	|ИЗ
	|	Справочник.ОСМИ_НастройкаСобытий КАК ОСМИ_НастройкаСобытий
	|ГДЕ
	|	ОСМИ_НастройкаСобытий.ОбъектКонфигурации = &ОбъектКонфигурации
	|	И ОСМИ_НастройкаСобытий.Использование";
	Запрос.УстановитьПараметр("ОбъектКонфигурации", Метаданные.НайтиПоТипу( ТипЗнч(Источник.Ссылка)).ПолноеИмя());
	
	Выб = ЗАпрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Выб.Ссылка.ПолучитьОбъект().ОтработатьСобытие(Источник);	
	КонецЦикла;	
	
КонецПроцедуры
