
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СобытияОсми = ОСМИ_РаботаСAPI.ПолучитьСписокНастроенныхСобытиый();	
	Если СобытияОсми.Успех Тогда
		Массив = СобытияОсми.Ответ.Events;		
		Для Каждого Событие из Массив Цикл
			Стр = События.Добавить();
			Стр.Метод  = Событие.method;
			Стр.Адрес  = Событие.url;
			Стр.Порт  = Событие.port;
			Стр.ИмяПользователя  = Событие.user;
			Стр.Пароль  = Событие.password;
			Стр.Событие  = Событие.event;
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	Для Каждого Строка Из События Цикл
		ОСМИ_РаботаСAPI.УстановитьНовоеСобытие(
			Строка.Метод,
			Строка.Адрес,
			Строка.ИмяПользователя,
			Строка.Пароль,
			Строка.Порт,
			Строка.Событие)
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры
