
&НаСервереБезКонтекста
Процедура ЗагрузитьССервераНаСервере()
	Список = ОСМИ_РаботаСAPI.ПолучитьСписокДоступныхГрафическихФайлов();
	Если Список.Успех Тогда
		Для Каждого Картинка Из Список.Ответ.images Цикл
			КартинкаСпр = Справочники.ОСМИ_Картинки.НайтиПоКоду(Картинка.ImgID);
			Если КартинкаСпр = Неопределено или КартинкаСпр = Справочники.ОСМИ_Картинки.ПустаяСсылка() Тогда 
				СпрОб = Справочники.ОСМИ_Картинки.СоздатьЭлемент();
				СпрОб.Наименование = Картинка.ImgDescription;
				СпрОб.Код = Картинка.ImgID;
				СпрОб.ТипКартинки = Перечисления.ОСМИ_ТипыКартинок[Картинка.imgType];
				СпрОб.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьССервера(Команда)
	ЗагрузитьССервераНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КартинкиПриАктивизацииСтроки(Элемент)
	Попытка
		Предосмотр = КартинкиПриАктивизацииСтрокиНаСервере(Элемент.ТекущиеДанные.Код);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КартинкиПриАктивизацииСтрокиНаСервере(Карта)
	Возврат Справочники.ОСМИ_Картинки.НайтиПоКоду(Карта).ПолучитьОбъект().ПолучитьСтрокуПредосмотра();
КонецФункции
