Функция ПолучитьСписокКарт() Экспорт
	
	Тип = Метаданные.ОпределяемыеТипы.ОСМИ_ДисконтнаяКарта.Тип.Типы()[0];
	Метаданные.НайтиПоТипу(Тип);
	
	Отбор = Новый Структура;
	Для Каждого Стр из Отборы Цикл
		Отбор.Вставить(Стр.Параметр,Стр.Значение);
	КонецЦикла;
	
	Выб = Справочники[Метаданные.НайтиПоТипу(Тип).Имя].Выбрать(,,Отбор);
	
	Массив = Новый Массив;
	Пока Выб.Следующий() Цикл
		Если Не Выб.ЭтоГруппа и не Выб.ПометкаУдаления Тогда
			Массив.Добавить(Выб.ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив;
КонецФункции