
&НаСервере
Процедура СоздатьКартуНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.СоздатьКарту();// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКарту(Команда)
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		СоздатьКартуНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	
	Об.УстановитьЗначенияПолей();//
	
	Карта = ОСМИ_РаботаСAPI.ЗапроситьИнформациюПокарте(Об.Код);
	
	Об.ПоляКарты.Очистить();
	
	Если Карта.Успех Тогда
		ЭтаФорма.Элементы.ФормаСоздатьКарту.Видимость = Ложь;
		
		Для Каждого Значение  из Карта.Ответ.values Цикл
			Стр = Об.ПоляКарты.Добавить();
			Стр.Поле = Значение.label;
			Стр.Значение = Значение.value; 
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(об,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарту(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, "Электронную карту необходимо сначала записать!");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		ОбновитьКартуНаСервере();
	Иначе
		ПоказатьПредупреждение(,"Не выбран шаблон!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры
